
// Подумать над структурой класса Ноутбук для магазина техники - выделить поля и методы. Реализовать в java.
// Создать множество ноутбуков.
// Написать метод, который будет запрашивать у пользователя критерий фильтрации и выведет ноутбуки, отвечающие фильтру.

// NoteBook notebook1 = new NoteBook
// NoteBook notebook2 = new NoteBook
// NoteBook notebook3 = new NoteBook
// NoteBook notebook4 = new NoteBook
// NoteBook notebook5 = new NoteBook

// Например: “Введите цифру, соответствующую необходимому критерию:
// 1 - ОЗУ
// 2 - Объем ЖД
// 3 - Операционная система
// 4 - Цвет

// Далее нужно запросить минимальные значения для указанных критериев - сохранить параметры фильтрации можно также в Map.

// Отфильтровать ноутбуки их первоначального множества и вывести проходящие по условиям.

// Класс сделать в отдельном файле

// приветствие
// Выбор параметра
// выбор конкретнее
// вывод подходящих

package homework6;

import java.util.HashMap;
import java.util.HashSet;
import java.util.Map;

public class Main1 {
    public static void main(String[] args) {
        Map<Integer, Integer> map = new HashMap<>();
        var notebooks = new HashSet<NoteBook>();
        notebooks = Data.input();
        map = Interf.interface1();
        notebooks = Filt.filter1(notebooks, map);
        if (notebooks.isEmpty())
            System.out.println("По заданным параметрам нет ноутбуков.");
        else
            Data.output(notebooks);
    }
}
